\documentclass[a4paper]{article}
\usepackage{PZ}

\usepackage{graphicx}

\graphicspath{ {./asm/screenshots/} }

\begin{document}
  \titlePage{МНОГОПОТОЧНОЕ ПРИЛОЖЕНИЕ ДЛЯ СИМУЛЯЦИИ РАБОТЫ БАЗЫ ДАННЫХ}
  \newpage
  \tableofcontents
  \newpage

  \section{Текст задания}
  Базу данных разделяют два типа процессов -- читатели и писатели.
  Читатели выполняют транзакции, которые просматривают записи базы данных, транзакции писателей и просматривают и изменяют записи.
  Предполагается, что в начале БД находится в непротиворечивом состоянии (т.е. отношения между данными имеют смысл).
  Каждая отдельная транзакция переводит БД из одного непротиворечивого состояния в другое.
  Для предотвращения взаимного влияния транзакций процесс-писатель должен иметь исключительный доступ к БД.
  Если к БД не обращается ни один из процессов-писателей, то выполнять транзакции могут одновременно сколько угодно читателей.
  Создать многопоточное приложение с потоками-писателями и потоками-читателями.
  Реализовать решение, используя семафоры. \cite{task}

  \newpage
  \section{Применяемые расчетные методы}
  \subsection{Структура БД}
  Из условия задачи сложно понять чем именно является база данных и как она должна выглядеть.
  Делать полноценную реляционную базу данных с таблицами для такой задачи будет очень сложно.
  Но и обычный список не пройдёт, потому что у него неможет быть противоречивых состояний и связей между объектами.
  Я решил использовать дерево, потому что его можно очень просто хранить:
  как массив индексов, где в каждом элементе хранится индекс его родителя.
  Если сделать ему фиксированный размер, то такое дерево будет сохраняться в файл в одну сточку:
  \texttt{fwrite(db, sizeof(int), DB\_SZIE, file)}.
  Также у него могут быть противоречивые состояния, например, при отсутствие общего корневого узла или при наличие циклов.

  \subsection{Вывод результата в консоль}
  Для большой наглядности вывод в консоль использует \texttt{\textbackslash{}x1b} чтобы изменять цвет текста \cite{ansi}.
  Также в \texttt{printf}-е используется опция выравнивания чисел пробелами.

  \subsection{Входные данные}
  Делать ввод списка всех читателей и писателей тут не надо.
  Понять правильно ли работает симуляция можно и с 10 читателями и писателями, запущенными со случайными задержками.

  \subsection{Алгоритм взаимодействия потоков}
  В программе есть один мьютекс для блокировки писателей.
  Его также используют читатели, чтобы понять есть ли сейчас активный писатель.
  Также у нас в семафоре хранится количество активных читателей и, когда оно достигает нуля, мы будим всех писателей,
  которые могли ждать закрытия всех читателей, потому что писатели, перед тем как начать писать,
  проверяют количество читателей в этом семафоре и ждут изменений, если из не ноль.

  \newpage
  \section{Тестовые примеры}
  Программа проводит симуляцию и наглядно выводит всё происходящие.
  \CRTfigref{db_basic.png}{Цветной вывод}

  Программа работает с базой данных и меняет её на диске.
  \CRTfigref{db_change.png}{База данных меняется на диске}

  \newpage
  \section{Список использованной литературы}
  \begin{thebibliography}{3}
    \bibitem{task} Практические приемы построения многопоточных приложений [Электронный ресурс].
      //URL: \url{http://softcraft.ru/edu/comparch/tasks/mp02/} (Дата обращения: 13.12.2020, режим доступа: свободный)
    \bibitem{man} pthreads(7) Linux User's Manual [Электронный ресурс].
      //URL: \url{https://man7.org/linux/man-pages/man7/pthreads.7.html} (Дата обращения: 15.11.2020, режим доступа: свободный)
    \bibitem{sem} sem\_overview(7) Linux User's Manual [Электронный ресурс].
    //URL: \url{https://man7.org/linux/man-pages/man7/sem_overview.7.html} (Дата обращения: 13.12.2020, режим доступа: свободный)
    \bibitem{mutex} pthread\_mutex\_lock(3p) Linux User's Manual [Электронный ресурс].
      //URL: \url{https://linux.die.net/man/3/pthread_mutex_lock} (Дата обращения: 13.12.2020, режим доступа: свободный)
    \bibitem{ansi} Статья <<ANSI escape code>> Wikipedia.org
      //URL: \url{https://en.wikipedia.org/wiki/ANSI_escape_code} (Дата обращения: 13.12.2020, режим доступа: свободный)
  \end{thebibliography}

\end{document}
